### 라이브러리 선언

In [8]:
import pandas as pd

In [9]:
import numpy as np

### 데이터 불러오기

In [10]:
selloutData = pd.read_csv("../dataset/kopo_channel_seasonality_new.csv")

In [11]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK      int64
QTY         float64
dtype: object

### 1. 데이터 통합 (타입 표준화)

In [12]:
selloutData["REGIONID"] = selloutData["REGIONID"].astype(str)
selloutData["PRODUCT"] = selloutData["PRODUCT"].astype(str)
selloutData["YEARWEEK"] = selloutData["YEARWEEK"].astype(str)
selloutData["QTY"] = selloutData["QTY"].astype(float)

In [13]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK     object
QTY         float64
dtype: object

### 2. 불량데이터 처리 (반품값 정제)

In [14]:
selloutData["QTY_NEW"] = np.where(selloutData["QTY"] < 0, 0, selloutData["QTY"])

In [15]:
len(selloutData)

124658

### 3. 불량데이터 처리 (53주차 제거)

In [56]:
selloutData["YEAR"] = selloutData.YEARWEEK.astype(str).str[0:4]
selloutData.head(1)

  REGIONID   PRODUCT YEARWEEK   QTY  QTY_NEW  YEAR WEEK
0      A60  PRODUCT4   201402  71.0     71.0  2014   02

In [57]:
selloutData["WEEK"] = selloutData.YEARWEEK.astype(str).str[4:]
selloutData.head(1)

  REGIONID   PRODUCT YEARWEEK   QTY  QTY_NEW  YEAR WEEK
0      A60  PRODUCT4   201402  71.0     71.0  2014   02

In [58]:
refinedSelloutData = selloutData[selloutData.WEEK.astype(int) <= 52]

In [59]:
len(refinedSelloutData)

123864

### 4. 데이터 정렬 및 집계

In [60]:
sortKey = ["REGIONID","PRODUCT","YEARWEEK"]

In [61]:
sortedData = refinedSelloutData.sort_values(sortKey)
sortedData.head()

     REGIONID    PRODUCT YEARWEEK    QTY  QTY_NEW  YEAR WEEK
298       A00  PRODUCT34   201401  661.0    661.0  2014   01
1757      A00  PRODUCT34   201402  679.0    679.0  2014   02
3125      A00  PRODUCT34   201403  578.0    578.0  2014   03
205       A00  PRODUCT34   201404  532.0    532.0  2014   04
4369      A00  PRODUCT34   201405  516.0    516.0  2014   05

In [62]:
### 기존 인덱스를 drop 하고 새로 인덱스를 생성
sortedData = sortedData.reset_index(drop=True)

In [63]:
sortedData.head(2)

  REGIONID    PRODUCT YEARWEEK    QTY  QTY_NEW  YEAR WEEK
0      A00  PRODUCT34   201401  661.0    661.0  2014   01
1      A00  PRODUCT34   201402  679.0    679.0  2014   02

In [64]:
sortedData.head()

  REGIONID    PRODUCT YEARWEEK    QTY  QTY_NEW  YEAR WEEK
0      A00  PRODUCT34   201401  661.0    661.0  2014   01
1      A00  PRODUCT34   201402  679.0    679.0  2014   02
2      A00  PRODUCT34   201403  578.0    578.0  2014   03
3      A00  PRODUCT34   201404  532.0    532.0  2014   04
4      A00  PRODUCT34   201405  516.0    516.0  2014   05

In [65]:
groupKey = ['REGIONID','PRODUCT','YEAR']

In [66]:
groupData = sortedData.groupby(groupKey).mean()[["QTY_NEW"]]

In [67]:
groupData.head()

                            QTY_NEW
REGIONID PRODUCT   YEAR
A00      PRODUCT34 2014  275.961538
                   2015   86.634615
                   2016   36.576923
         PRODUCT58 2014    2.673077
                   2015    5.711538

In [68]:
groupData = groupData.reset_index()

In [69]:
groupData.head()

  REGIONID    PRODUCT  YEAR     QTY_NEW
0      A00  PRODUCT34  2014  275.961538
1      A00  PRODUCT34  2015   86.634615
2      A00  PRODUCT34  2016   36.576923
3      A00  PRODUCT58  2014    2.673077
4      A00  PRODUCT58  2015    5.711538

In [70]:
groupData.columns = ["REGIONID","PRODUCT","YEAR","QTY_MEAN"]

### 5. 데이터전처리 완료데이터 / 분석 집계데이터 합치기

In [71]:
refinedSelloutData.head(4)

  REGIONID    PRODUCT YEARWEEK      QTY  QTY_NEW  YEAR WEEK
0      A60   PRODUCT4   201402     71.0     71.0  2014   02
1      A60  PRODUCT59   201402  22275.0  22275.0  2014   02
2      A60  PRODUCT34   201402   4463.0   4463.0  2014   02
3      A60  PRODUCT47   201402      0.0      0.0  2014   02

In [72]:
groupData.head()

  REGIONID    PRODUCT  YEAR    QTY_MEAN
0      A00  PRODUCT34  2014  275.961538
1      A00  PRODUCT34  2015   86.634615
2      A00  PRODUCT34  2016   36.576923
3      A00  PRODUCT58  2014    2.673077
4      A00  PRODUCT58  2015    5.711538

In [73]:
joinKey = ["REGIONID","PRODUCT","YEAR"]
joinKey

['REGIONID', 'PRODUCT', 'YEAR']

In [74]:
mergedData = pd.merge(refinedSelloutData,groupData,\
         left_on=joinKey, right_on=joinKey) \
[["REGIONID","PRODUCT","YEARWEEK","YEAR","WEEK","QTY_NEW","QTY_MEAN"]]

In [75]:
mergedData.head()

  REGIONID   PRODUCT YEARWEEK  YEAR WEEK  QTY_NEW   QTY_MEAN
0      A60  PRODUCT4   201402  2014   02     71.0  29.134615
1      A60  PRODUCT4   201401  2014   01     16.0  29.134615
2      A60  PRODUCT4   201403  2014   03     51.0  29.134615
3      A60  PRODUCT4   201406  2014   06     19.0  29.134615
4      A60  PRODUCT4   201404  2014   04     21.0  29.134615